source/test1/src/main/resources/de/hszg/xml/fuse/wsdl/Trader2EndpointPort.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="Trader2Endpoint" targetNamespace="http://j2ee.netbeans.org/wsdl/ProductAdministration/src/newWSDL" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:ns="http://xml.netbeans.org/schema/Request" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://j2ee.netbeans.org/wsdl/ProductAdministration/src/newWSDL" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types>
    <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/ProductAdministration/src/newWSDL">
            <xsd:import namespace="http://xml.netbeans.org/schema/Request" schemaLocation="http://141.46.192.69:9080/Trader2-sun-http-binding/ProductAdministration/request.xsd"/>
        </xsd:schema>
  </types>
  <message name="Trader2EndpointOperationResponse">
    <part name="TraderEndpointOutput" type="xsd:string">
    </part>
  </message>
  <message name="Trader2EndpointOperationRequest">
    <part name="TraderEndpointInput" type="ns:request">
    </part>
  </message>
  <portType name="Trader2EndpointPortType">
    <operation name="Trader2EndpointOperation">
      <input name="input1" message="tns:Trader2EndpointOperationRequest">
    </input>
      <output name="output1" message="tns:Trader2EndpointOperationResponse">
    </output>
    </operation>
  </portType>
  <binding name="Trader2EndpointBinding" type="tns:Trader2EndpointPortType">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="Trader2EndpointOperation">
      <soap:operation/>
      <input name="input1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/ProductAdministration/src/newWSDL"/>
      </input>
      <output name="output1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/ProductAdministration/src/newWSDL"/>
      </output>
    </operation>
  </binding>
  <service name="Trader2EndpointService">
    <port name="Trader2EndpointPort" binding="tns:Trader2EndpointBinding">
      <soap:address location="http://141.46.192.69:9080/Trader2EndpointService/Trader2EndpointPort"/>
    </port>
  </service>
    <plnk:partnerLinkType name="Trader2Endpoint">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="Trader2EndpointPortTypeRole" portType="tns:Trader2EndpointPortType"/>
    </plnk:partnerLinkType>
</definitions>
