xmls/openESB/all

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/ProductAdministration/src/newWSDL" xmlns:req="http://xml.netbeans.org/schema/Request">
  <soapenv:Body>
    <new:Trader2EndpointOperation>
      <TraderEndpointInput>
        <req:requestTyp>all</req:requestTyp>
        <req:requestContent>
          <!--You have a CHOICE of the next 2 items at this level-->
          <req:payment>
            <req:personality>
              <req:firstname>?string?</req:firstname>
              <req:lastname>?string?</req:lastname>
              <req:address>?string?</req:address>
              <req:zipcode>?7?</req:zipcode>
              <req:city>?string?</req:city>
            </req:personality>
            <req:billing>
              <req:accountnumber>?7?</req:accountnumber>
              <req:bankcode>?7?</req:bankcode>
            </req:billing>
            <req:objects>?string?</req:objects>
          </req:payment>
          <req:search>
            <!--You have a CHOICE of the next 3 items at this level-->
            <req:mainGroup>?string?</req:mainGroup>
            <req:subGroup>?string?</req:subGroup>
            <req:objectName>?string?</req:objectName>
          </req:search>
        </req:requestContent>
      </TraderEndpointInput>
    </new:Trader2EndpointOperation>
  </soapenv:Body>
</soapenv:Envelope>
